; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v7 - type_2 ?v2 - type_1)
 	      (pred_4 ?v4 - object ?v2 - type_1)
	      (pred_3 ?v7 - type_2 ?v1 - type_3)
	      (pred_1 ?v7 - type_2 ?v4 - object ?v1 - type_3))

   (:action op_1
       :parameters  (?v7 - type_2 ?v3 ?v5 - type_1)
       :precondition (and  (pred_2 ?v7 ?v3))
       :effect (and  (pred_2 ?v7 ?v5)
		     (not (pred_2 ?v7 ?v3))))

   (:action op_2
       :parameters (?v7 - type_2 ?v8 - object ?v6 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v6) (pred_2 ?v7 ?v6) (pred_3 ?v7 ?v1))
       :effect (and (pred_1 ?v7 ?v8 ?v1)
		    (not (pred_4 ?v8 ?v6)) 
		    (not (pred_3 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_2 ?v8 - object ?v6 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_1 ?v7 ?v8 ?v1) (pred_2 ?v7 ?v6))
       :effect (and (pred_4 ?v8 ?v6)
		    (pred_3 ?v7 ?v1)
		    (not (pred_1 ?v7 ?v8 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_01 obj_04 - type_2
obj_13 obj_05 obj_07 obj_09 - type_3
obj_06 obj_12 obj_02 obj_10 - type_1
obj_11 obj_08 obj_03 - object)
(:init
(pred_2 obj_01 obj_10)
(pred_3 obj_01 obj_13)
(pred_3 obj_01 obj_05)
(pred_2 obj_04 obj_12)
(pred_3 obj_04 obj_07)
(pred_3 obj_04 obj_09)
(pred_4 obj_11 obj_06)
(pred_4 obj_08 obj_12)
(pred_4 obj_03 obj_02)
)
(:goal
(and
(pred_4 obj_11 obj_02)
(pred_4 obj_08 obj_10)
(pred_4 obj_03 obj_10)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_01 obj_10) (pred_2 obj_04 obj_10))))
  )
)
)

; plan
1. (op_2 obj_04 obj_08 obj_12 obj_09)
   deleted: (pred_4 obj_08 obj_12) (pred_3 obj_04 obj_09)
   added: (pred_1 obj_04 obj_08 obj_09)
   goals met: 0 of 3
2. (op_1 obj_01 obj_10 obj_06)
   deleted: (pred_2 obj_01 obj_10)
   added: (pred_2 obj_01 obj_06)
   goals met: 0 of 3
3. (op_1 obj_04 obj_12 obj_06)
   deleted: (pred_2 obj_04 obj_12)
   added: (pred_2 obj_04 obj_06)
   goals met: 0 of 3
4. (op_2 obj_04 obj_11 obj_06 obj_07)
   deleted: (pred_4 obj_11 obj_06) (pred_3 obj_04 obj_07)
   added: (pred_1 obj_04 obj_11 obj_07)
   goals met: 0 of 3
5. (op_1 obj_04 obj_06 obj_02)
   deleted: (pred_2 obj_04 obj_06)
   added: (pred_2 obj_04 obj_02)
   goals met: 0 of 3
6. (op_3 obj_04 obj_11 obj_02 obj_07)
   deleted: (pred_1 obj_04 obj_11 obj_07)
   added: (pred_4 obj_11 obj_02) (pred_3 obj_04 obj_07)
   goals met: 1 of 3
7. (op_2 obj_04 obj_03 obj_02 obj_07)
   deleted: (pred_4 obj_03 obj_02) (pred_3 obj_04 obj_07)
   added: (pred_1 obj_04 obj_03 obj_07)
   goals met: 1 of 3
8. (op_1 obj_04 obj_02 obj_10)
   deleted: (pred_2 obj_04 obj_02)
   added: (pred_2 obj_04 obj_10)
   goals met: 1 of 3
9. (op_3 obj_04 obj_03 obj_10 obj_07)
   deleted: (pred_1 obj_04 obj_03 obj_07)
   added: (pred_4 obj_03 obj_10) (pred_3 obj_04 obj_07)
   goals met: 2 of 3
10. (op_3 obj_04 obj_08 obj_10 obj_09)
   deleted: (pred_1 obj_04 obj_08 obj_09)
   added: (pred_4 obj_08 obj_10) (pred_3 obj_04 obj_09)
   goals met: 3 of 3
